package com.iweb;

import com.iweb.view.View;

/**
 * 1.登录 注册(同时提供电话 收货地址等信息)
 * 2.登录的时候分为管理员和非管理员
 * 管理员可以操作数据 非管理员只能查看
 * 管理员可以对商品进行CRUD 可以对分类进行CURD 也可以对对应的商品属性进行管理
 * 属性操作和属性值操作
 * 管理员还可以查看订单和订单的详情
 * 管理员可以对指定订单进行发货或者同一退货处理
 * 最终小组需要提交的是同时具备前台和后台的项目的git地址
 * 组长需要在git上创建仓库 给所有组员分配git权限 使用git进行协同开发
 * 最终我要看到每一个人的提交记录
 *
 * model 模型层 实体类和jdbc
 * view 视图 打印界面
 * controller 决定了 接受不同的参数 跳转到不同的视图
 * service 你的数据操作的逻辑和代码逻辑
 * util 工具类
 * 其余包自行定义
 * @author YangXinYue
 * @date 2023/7/17 15:48
 */
public class Test {
//    测试 用户登录 注册
//    View v = new View();


//    测试用户查看商品
//    测试管理员注册
//    测试管理员增删改查商品
//    测试管理员增删改商品属性
//    测试管理员查看订单
//    测试管理员查看订单内容
//    测试用户查看购物车

}
